app/Http/Controllers/ImportDatosController.php

select `id_Program` from `Programs` where NAME limit 1
select `id_TypeTransmition` from `TypeTransmition` where `nameTransmition` = 'empty' limit 1
---
  public function importarDatosExcel(Request $request){
    $request->validate(['fileTransmition'=>'required']);
    $path = $request->file('fileTransmition')->getRealPath();
    $data = Excel::load($path, function($reader) {$reader->ignoreEmpty();})->get();
    $arrData = $data->toArray();

     if(!empty($data) && $data->count()){
       foreach ($arrData as $key => $row)
       {
         $idNewProgram = 0;
         $insert[]=array();
        //  $namePrograma_= DB::table('Programs')->whereRaw($this->eliminar_simbolos("name"),$this->eliminar_simbolos($row['id_program']))->value('id_Program');
         $id_program_= DB::table('Programs')->whereRaw($this->eliminar_simbolos("name"),$this->eliminar_simbolos($row['id_program']))->value('id_Program');
         $id_typetransmition_= DB::table('TypeTransmition')->where("nameTransmition",$row['id_typetransmition'])->value('id_TypeTransmition');